Revit 2026 API

# STEPImportOptions(STEPImportOptions) Constructor

---

Constructs a new instance of STEPImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public STEPImportOptions(
	STEPImportOptions option
)
```
```vb
Public Sub New (
	option As STEPImportOptions
)
```
```cpp
public:
STEPImportOptions(
	STEPImportOptions^ option
)
```
```fsharp
new :
        option : STEPImportOptions -> STEPImportOptions
```

#### Parameters

option STEPImportOptions
     The STEP options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

STEPImportOptions Class

STEPImportOptions Overload

Autodesk.Revit.DB Namespace